<div class="welcome">
    <h1>Храните регулярные выражения онлайн, делитесь ими с друзьями!</h1>
    <p>X-Replace - это онлайновый текстовый редактор с поддержкой регулярных выражений. Главная особенность редактора - он позволяет не только тестировать регулярные выражения, но и сохранять их, а также применять их группами. Чтобы вы могли быстрее освоиться с редактором, мы создали образец категории, содержащий различные правила, которые вы можете применять, изменять и удалять по своему усмотрению. Просто нажмите кнопку "Копировать категорию-образец":</p>
    <div><img src="<?php echo base_url('assets/images/faq/ru')?>/clone.png"></div>
    <p>и начните свое знакомство с редактором.</p>
    <p>Редактор имеет множество функций, поэтому не забудьте посетить наш раздел <a href="<?php echo base_url('index.php/editor/faq') ?>">"Справка"</a>, где вы сможете узнать обо всех его возможностях.</p>
    <p>Редактор не требует регистрации, но для незарегистрированных пользователей все их данные сохраняются только на время текущей сессии - т. е. до закрытия окна браузера и не более 24 часов.</p>
    <p>Тем не менее, вы можете сохранить отдельные категории с их группами и правилами и без регистрации на сайте. Для этого нажмите кнопку "Создать снимок категории":</p>
<div><img src="<?php echo base_url('assets/images/faq/ru')?>/snapshot.png"></div>
    <p>а затем скопируйте и сохраните ссылку из адресной строки браузера. После этого вы сможете в любой момент загрузить сохраненную категорию в том состоянии, в котором она была на момент создания "снимка", а также поделиться этой ссылкой с друзьями. Чтобы получить копию сохраненной категории, вставьте скопированную ссылку в адресную строку браузера и нажмите Enter.</p>
    <p>Если вы новичок в регулярных выражениях, мы рекомендуем вам посетить один из следующих полезных ресурсов:</p>
    <ul>
        <li>Регулярные выражения на <a href="http://ru.wikipedia.org/wiki/%D0%A0%D0%B5%D0%B3%D1%83%D0%BB%D1%8F%D1%80%D0%BD%D1%8B%D0%B5_%D0%B2%D1%8B%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F" target="_blank">Википедии</a></li>
        <li><a href="http://www.regular-expressions.info" target="_blank">www.regular-expressions.info</a>&nbsp;<sup>(англ.)</sup></li>
        <li><a href="http://www.rexegg.com" target="_blank">www.rexegg.com</a>&nbsp;<sup>(англ.)</sup></li>
    </ul>
    <p>Удачи!</p>
</div>